app/views/pages/home.html.erb

	<h1>Links from <a href="https://twitter.com/i/lists/<%=LIST_ID%>">philosophy Twitter</a> <%=link_to image_tag('rss.png'), root_url(:format => :rss)%></h1>
	<p class="lead"><% if @links.any? %><%=@links.count%> links. Last refreshed <%=Link.order("created_at ASC").limit(1).created_at%><% end %></p>
---
SELECT  "links".* FROM "links" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "links"