app/controllers/links_controller.rb

INSERT INTO "links" ("title", "url", "posted_at", "user", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @link = Link.new(link_params)

    respond_to do |format|
      if @link.save