app/controllers/links_controller.rb

  def fetch
    @link.update_title!
---
UPDATE "links" SET "url" = $1, "title" = $2, "updated_at" = $3 WHERE "links"."id" = $4  [["url", "http://nautil.us/issue/75/story/the-tricky-problem-with-other-minds"], ["title", "Nautilus | Science Connected"], ["updated_at", "2019-08-29 21:43:46.783345"], ["id", 14]]

  def update
    respond_to do |format|
      if @link.update(link_params)
---
UPDATE "links" SET "posted_at" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["posted_at", "2019-08-29 19:50:00"], ["updated_at", "2019-08-29 21:56:36.805422"], ["id", 29]]

  def destroy
    @link.delete!
---
UPDATE "links" SET "deleted" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["deleted", true], ["updated_at", "2019-08-29 23:57:29.753917"], ["id", 4]]
DELETE FROM "links" WHERE "links"."id" = $1  [["id", 30]]