app/models/link.rb

	def self.all_but_deleted
		where({deleted: false}).order('created_at ASC')
---
SELECT  "links".* FROM "links" ORDER BY created_at ASC LIMIT $1  [["LIMIT", 1]]

	def self.fetch_links
		links = []
		last_link = Link.order('created_at ASC').first
		timeline_options = {count: FETCH_COUNT}
		if last_link
			timeline_options[since_id: last_link.tweet_id]
		end

		TWITTER.list_timeline("philosophers", timeline_options).each do |tweet|
			text = tweet.full_text
			logger.debug text
			urls = URI.extract(text)
			urls = urls.select{|uri| uri && (uri.starts_with?("https://") || uri.starts_with?("http://"))}
			urls = urls.map{|url| resolved_url(url)}
			urls = urls.select{|url| url && !url.starts_with?("https://twitter.com")}
			urls.each do |url|
				unless Link.where({url: url}).count > 0
					title = get_title(url)
					posted_at = tweet.created_at
					user_name = tweet.user.name
					user_screenname = tweet.user.screen_name
					logger.info "##{tweet.id} #{title} <#{url}> by #{user_name} <@#{user_screenname}> on #{posted_at}"
					links << {id: tweet.id, url: url, title: title, user_name: user_name, user_screenname: user_screenname, posted_at: posted_at} unless url.nil? || title.nil?
---
SELECT COUNT(*) FROM "links" WHERE "links"."url" = $1  [["url", "https://www.nytimes.com/2019/08/28/climate/fire-amazon-africa-siberia-worldwide.html?smid=nytcore-ios-share"]]
INSERT INTO "links" ("tweet_id", "title", "url", "posted_at", "user_name", "user_screenname", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"